Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_resource_group.atlantis will be created
+ resource "azurerm_resource_group" "atlantis" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "atlantis-resources"
    }

  # azurerm_virtual_network.atlantis will be created
+ resource "azurerm_virtual_network" "atlantis" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "test-atlantis-vnet"
      + resource_group_name = "atlantis-resources"
      + subnet              = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ resource_group_name  = "atlantis-resources"
+ virtual_network_name = "test-atlantis-vnet"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.eastus.cloudapp.azure.com:4141/lock?id=HMDigitalHie%252Fatlantis-demo%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`